<H1 >Intro to Pandas</H1>

<p>When working with tabular data, such as data stored in spreadsheets or databases, pandas is the right tool for you. pandas will help you to explore, clean, and process your data. In pandas, a data table is called a DataFrame</p>



<img alt="../_images/01_table_dataframe.svg" class="align-center" src="https://pandas.pydata.org/pandas-docs/stable/_images/01_table_dataframe.svg">

<p style="font-style: italic;font-weight: bold;">A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the <code>data.frame</code> in R.</p>

In [8]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
dic={'name':['Nisa','falak'],'Age':[40,18]}
df=pd.DataFrame(dic)

In [4]:
df.dtypes

name    object
Age      int64
dtype: object

In [10]:
data=pd.read_csv('https://raw.githubusercontent.com/slmsshk/DataSet-main/main/Salaries.csv',error_bad_lines=False)
data

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [14]:
r"C:\Users\Slmss\OneDrive\Desktop\A.I\DataSet-main\brain_networks.csv"

'C:\\Users\\Slmss\\OneDrive\\Desktop\\A.I\\DataSet-main\\brain_networks.csv'

In [13]:
"C:\\Users\\Slmss\\OneDrive\\Desktop\\A.I\\DataSet-main\\brain_networks.csv"

'C:\\Users\\Slmss\\OneDrive\\Desktop\\A.I\\DataSet-main\\brain_networks.csv'

In [20]:
pd.read_csv('https://raw.githubusercontent.com/slmsshk/DataSet-main/main/AirPassengers.csv')

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

In [18]:
# Storing path
path=r"C:\Users\Slmss\OneDrive\Desktop\A.I\DataSet-main\Computers.csv"

# Reading CSV
data2=pd.read_csv(path,index_col=0)
data2

      price  speed    hd  ram  screen   cd multi premium  ads  trend
1      1499     25    80    4      14   no    no     yes   94      1
2      1795     33    85    2      14   no    no     yes   94      1
3      1595     25   170    4      15   no    no     yes   94      1
4      1849     25   170    8      14   no    no      no   94      1
5      3295     33   340   16      14   no    no     yes   94      1
...     ...    ...   ...  ...     ...  ...   ...     ...  ...    ...
6255   1690    100   528    8      15   no    no     yes   39     35
6256   2223     66   850   16      15  yes   yes     yes   39     35
6257   2654    100  1200   24      15  yes    no     yes   39     35
6258   2195    100   850   16      15  yes    no     yes   39     35
6259   2490    100   850   16      17  yes    no     yes   39     35

[6259 rows x 10 columns]

In [25]:
list_=[1,2,3]

In [26]:
list_()

TypeError: 'list' object is not callable

In [30]:
# get col names
data.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [44]:
rank=data['rank']
print(type(rank))

KeyboardInterrupt

In [42]:
da=data[['service','sex']]
print(type(da))

<class 'pandas.core.frame.DataFrame'>

In [38]:
rank.dtype

dtype('O')

In [37]:
data.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [36]:
type(rank)

pandas.core.series.Series

In [35]:
rank2=data.discipline
rank2

0     B
1     A
2     A
3     A
4     B
     ..
73    B
74    B
75    B
76    A
77    A
Name: discipline, Length: 78, dtype: object

In [28]:
data.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [21]:
data.head() #Function/Method

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

<p><span style='color:green;font-size:20px'>Load</span><span style='color:blue;font-size:20px'> Pandas</span></p>
<p>To load the pandas package and start working with it, import the package. The community agreed alias for pandas is <code>pd</code>, so loading pandas as <code >pd</code> is assumed standard practice for all of the pandas documentation.</p>

In [1]:
import pandas as pd

<p><span style="font-weight:bold;font-size:20px;color:#100c08">  Creating a</span> <span style='color:#a4c639;font-size:20px;font-weight:bold'>DataFrame.</span><p>

In [6]:
pd.DataFrame({'Col1':['Row1', 'ROw2', 'ROw3','Rows4'],'Col2':['Row1', 'ROw2', 'ROw3','Nan']})

    Col1  Col2
0   Row1  Row1
1   ROw2  ROw2
2   ROw3  ROw3
3  Rows4   Nan

In [7]:
# Mnemonic name for DataFrame df 

df=pd.DataFrame({    
    'Name':['Simran','Rohit','Raghu','Saachi','Kavya'],
    "Age":[i for i in range(30,80,10)],
    "Experience":[i for i in range(5,18,3)]})


df

     Name  Age  Experience
0  Simran   30           5
1   Rohit   40           8
2   Raghu   50          11
3  Saachi   60          14
4   Kavya   70          17

<p>Notice that the inferred dtype is int64 & object.</p>

In [8]:
df.dtypes

Name          object
Age            int64
Experience     int64
dtype: object

<p>To enforce a single dtype:</p>

In [10]:
import numpy as np
import warnings
warnings.filterwarnings('ignore')
df=pd.DataFrame({    
    'Name':['Simran','Rohit','Raghu','Saachi','Kavya'],
    "Age":[i for i in range(30,80,10)],
    "Experience":[i for i in range(5,18,3)]},dtype=np.str)


df.dtypes

Name          object
Age           object
Experience    object
dtype: object

<p>Constructing DataFrame from a dictionary including Series:</p>

In [ ]:
df=pd.DataFrame({    
    'Name':['Simran','Rohit','Raghu','Saachi','Kavya'],
    "Age":[i for i in range(30,80,10)],
    "Experience":pd.Series([i for i in range(5,18,3)])})

df

<p>Constructing DataFrame from numpy ndarray:</p>

In [ ]:
# Genrate Random column names
from random_word import RandomWords
r = RandomWords()

labels=[r.get_random_word() for i in range(10)]
arr=np.random.randint(1,1000,100).reshape(10,10)
df=pd.DataFrame(arr,columns=labels)

df

<p style="font-size:25px;color:#f2f3f4"><mark>Attributes</mark></p>

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:	#008000;font-size:20px">𝓪𝓽</span></p>
<p>Access a single value for a row/column label pair.</p>
<p>Similar to <code><span>loc</span></code>, in that both provide label-based lookups. Use
<code ><span >at</span></code> if you only need to get or set a single value in a DataFrame
or Series.</p>

In [ ]:
df.at[0,'lathery']

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:	#008000;font-size:20px">𝓪𝔁𝓮𝓼</span></p>
<p>Return a list representing the axes of the DataFrame.</p>
<p>It has the row axis labels and column axis labels as the only members.
They are returned in that order.</p>

In [ ]:
df.axes

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:	#008000;font-size:20px">𝓬𝓸𝓵𝓾𝓶𝓷𝓼</span></p>
<p>The column labels of the DataFrame.</p>

In [ ]:
df.columns

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:	#008000;font-size:20px">𝓭𝓽𝔂𝓹𝓮𝓼</span></p>
<p>Return the dtypes in the DataFrame.</p>
<p>This returns a Series with the data type of each column.
The result’s index is the original DataFrame’s columns. Columns with mixed types are stored with the <code><span>object</span></code> dtype.</p>

In [ ]:
df.dtypes

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓮𝓶𝓹𝓽𝔂</span></p><hr>
Checks if a Series/DataFrame is completely empty

In [ ]:
df.empty

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓲𝓪𝓽</span></p>
<p>Access a single value for a row/column pair by integer position.</p>
<p>Similar to <code class="docutils literal notranslate"><span class="pre">iloc</span></code>, in that both provide integer-based lookups. Use
<code class="docutils literal notranslate"><span class="pre">iat</span></code> if you only need to get or set a single value in a DataFrame
or Series.</p>

In [ ]:
df.iat[0,0]

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓲𝓵𝓸𝓬</span></p>
<p>Purely integer-location based indexing for selection by position.</p>
<p><code><span>.iloc[]</span></code> is primarily integer position based (from <code><span>0</span></code> to
<code><span>length-1</span></code> of the axis), but may also be used with a boolean array.</p>

<p>Allowed inputs are:</p>
<ul>
<li><p>An integer, e.g. <code><span>5</span></code>.</p></li>
<li><p>A list or array of integers, e.g. <code><span>[4,</span> <span>3,</span> <span>0]</span></code>.</p></li>
<li><p>A slice object with ints, e.g. <code><span>1:7</span></code>.</p></li>
<li><p>A boolean array.</p></li>
<li><p>A <code><span>callable</span></code> function with one argument (the calling Series or
DataFrame) and that returns valid output for indexing (one of the above).
This is useful in method chains, when you don’t have a reference to the
calling object, but would like to base your selection on some value.</p></li>
</ul>

<p><code><span>.iloc</span></code> will raise <code><span>IndexError</span></code> if a requested indexer is
out-of-bounds, except <em>slice</em> indexers which allow out-of-bounds indexing (this conforms with python/numpy <em>slice</em> semantics).</p>

In [ ]:
df.iloc[0:,0:]

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓲ndex</span></p>
<p>The index (row labels) of the DataFrame.</p>

In [ ]:
df.index

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓵𝓸𝓬</span></p>
<p>Access a group of rows and columns by label(s) or a boolean array.</p>
<p><code><span>.loc[]</span></code> is primarily label based, but may also be used with a boolean array.</p>

<p>Allowed inputs are:</p>
<ul>
<li><p>A single label, e.g. <code><span>5</span></code> or <code><span>'a'</span></code>, (note that <code><span>5</span></code> is
interpreted as a <em>label</em> of the index, and <strong>never</strong> as an
integer position along the index).</p></li>
<li><p>A list or array of labels, e.g. <code><span>['a',</span> <span>'b',</span> <span>'c']</span></code>.</p></li>
<li><p>A slice object with labels, e.g. <code><span>'a':'f'</span></code>.</p>
<div>
<p>Warning</p>
<p>Note that contrary to usual python slices, <strong>both</strong> the
start and the stop are included</p>
</div>
</li>
<li><p>A boolean array of the same length as the axis being sliced,
e.g. <code><span>[True,</span> <span>False,</span> <span>True]</span></code>.</p></li>
<li><p>An alignable boolean Series. The index of the key will be aligned before
masking.</p></li>
<li><p>An alignable Index. The Index of the returned selection will be the input.</p></li>
<li><p>A <code><span>callable</span></code> function with one argument (the calling Series or
DataFrame) and that returns valid output for indexing (one of the above)</p></li>
</ul>

In [ ]:
df.loc[5]

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓷𝓭𝓲𝓶</span></p>

<p>Return an int representing the number of axes / array dimensions.</p>
<p>Return 1 if Series. Otherwise return 2 if DataFrame.</p>

In [ ]:
df.ndim

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓼𝓱𝓪𝓹𝓮</span></p>
<p>Return a tuple representing the dimensionality of the DataFrame.</p>

In [ ]:
df.shape

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓼𝓲𝔃𝓮</span></p>

<p>Return an int representing the number of elements in this object.</p>
<p>Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.</p>

In [ ]:
df.size

<p style=";font-size:20px">𝓓𝓪𝓽𝓪𝓕𝓻𝓪𝓶𝓮.<span style="color:#008000;font-size:20px">𝓿𝓪𝓵𝓾𝓮𝓼</span></p>
<p>Return a Numpy representation of the DataFrame.</p>

In [ ]:
x=df.values
x


<H2><span style="color:blue">Read</span> and <span style="color:green">Write.</span> Tabular data</H2>
<p>pandas supports the integration with many file formats or data sources out of the box (csv, excel, sql, json, parquet,…). Importing data from each of these
data sources is provided by function with the prefix <code class="docutils literal notranslate"><span class="pre">read_*</span></code>. Similarly, the <code class="docutils literal notranslate"><span class="pre">to_*</span></code> methods are used to store data.</p>

<img alt="../_images/02_io_readwrite.svg" class="align-center" src="https://pandas.pydata.org/pandas-docs/stable/_images/02_io_readwrite.svg">